# OutdoorAirPerPerson Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
HVACLoadType..::..OutdoorAirPerPerson Property
HVACLoadType Class See Also
---
The outdoor air per person.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double OutdoorAirPerPerson { get; set; }
```

Visual Basic
---
```text
Public Property OutdoorAirPerPerson As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double OutdoorAirPerPerson {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The value should be between [0.0,166.66]. |

# See Also
HVACLoadType Class
Autodesk.Revit.DB.Analysis Namespace